{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Tracker closed since the Windows Ribbon Framework itself can&#39;t be run on Windows XP",
    "ClosedDate": "2010-01-30T11:45:37.827-08:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "I've installed Win 7 SDK on windows XP SP3, I have VS Studio 2008 SP1, all updates from Windows Update, downloaded the Ribbon for winforms projects and I can't run any of the projects becasue I am getting an error saying that the Ribbon is not on the system.",
    "LastUpdatedDate": "2013-05-16T03:57:06.253-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "windowsribbon",
    "ReportedDate": "2010-01-28T13:22:52.653-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Not working on Win XP SP3 which is a supported platform",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 3710
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "This is correct! Ribbon is only supported on Vista/Server 2008 Sp2 with Update KB960362 (Description of Windows Ribbon and Animation Manager Library) and Windows 7/Server 2008R2.\r\n\r\nWindows XP Sp3 doesn't support the native Ribbon!",
      "PostedDate": "2010-01-29T04:09:57.877-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Hi,\r\n\r\nWell, I don't understand why you say that because the Windows 7 SDK release notes sat that XP SP3 is a supported OS. PLEASE check the Win 7 SDK release notes especially on point 3 that I am copying below:\r\n\r\n3.  Supported Compiler, Platforms, and Related Software\r\n\r\nThis release of the Windows SDK supports Microsoft Visual Studio 2005 SP1, Microsoft Visual Studio 2008 SP1, and the Microsoft Visual Studio 2008 Express Editions. Express Editions of Visual Studio are available to download from the Visual Studio Express site free of charge.\r\n\r\nThis release of the Windows SDK supports x86, x64, and IA64 platform architectures for building and running applications on Windows XP SP3, Windows Server 2003 R2, Windows Vista, Windows Server 2008, and Windows 7.",
      "PostedDate": "2010-01-29T05:01:21.633-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Check Windows Ribbon documentation http://msdn.microsoft.com/en-us/library/dd371191(VS.85).aspx, under \"Minimum Requirements\".\r\n\r\nThe release notes of Windows SDK refers to the Windows SDK. This means you can install the Windows 7 SDK on Windows XP. It doesn't mean that every windows 7 feature is supported on XP.\r\n\r\nSurly you don't expect the Windows 7 task bar to work on windows XP, but it is in the SDK..\r\n",
      "PostedDate": "2010-01-29T11:26:44.467-08:00",
      "Id": -2147483648
    },
    {
      "Message": "So, why the windows 7 SDK for XP  if we cannot develop most of the windows 7 features in XP?! It is useless in XP from what you are saying! Why did Microsoft made the SDK available in XP then? I really don't get it!",
      "PostedDate": "2010-01-29T16:47:38.017-08:00",
      "Id": -2147483648
    },
    {
      "Message": "@Giorgito \r\n\r\nYou CAN DEVELOP on XP, but you CAN'T RUN the apps on XP becasue XP doesn't have the COM Object which provides the native Ribbon. Is this so hard to understand?????????????????????\r\n\r\nSorry, this is my last reply to your question, because you are simply not willing to read and understand our comments.",
      "PostedDate": "2010-01-30T08:09:16.21-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2010-01-30T11:45:37.827-08:00",
      "Id": -2147483648
    },
    {
      "Message": "How can you develop on XP if you can't run it?! Sorry but it doesn't make sense! Are you a programmer? If yes, then you know that to develop you have to code, run, test, code again, run, test, and many cycles like this until you are happy with the application and then build and release the application SO what you are saying doens't make sense!",
      "PostedDate": "2010-01-30T13:46:53.717-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T16:15:49.927-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T03:57:06.253-07:00",
      "Id": -2147483648
    }
  ]
}